In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [17]:
df = pd.read_csv('titanic.csv')

In [18]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
X = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Survived','Embarked'],axis='columns')
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [48]:
y = df.Survived

In [49]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [85]:
X.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [86]:
new = X
new.Sex = le.fit_transform(new.Sex)

In [87]:
new.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [88]:
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [89]:
median = new.Age.median()
median

28.0

In [90]:
new.Age.fillna(median)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [91]:
print(new.isnull().sum())

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [92]:
age = new.Age.fillna(28)
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [93]:
df1 = new.drop(['Age'], axis='columns')

In [94]:
df1.head(5)

   Pclass  Sex     Fare
0       3    1   7.2500
1       1    0  71.2833
2       3    0   7.9250
3       1    0  53.1000
4       3    1   8.0500

In [95]:
df2 = pd.concat([df1,age],axis='columns')
df2.head(10)

   Pclass  Sex     Fare   Age
0       3    1   7.2500  22.0
1       1    0  71.2833  38.0
2       3    0   7.9250  26.0
3       1    0  53.1000  35.0
4       3    1   8.0500  35.0
5       3    1   8.4583  28.0
6       1    1  51.8625  54.0
7       3    1  21.0750   2.0
8       3    0  11.1333  27.0
9       2    0  30.0708  14.0

In [96]:
print(df1.isnull().sum())

Pclass    0
Sex       0
Fare      0
dtype: int64

In [98]:
df2.head(5)

   Pclass  Sex     Fare   Age
0       3    1   7.2500  22.0
1       1    0  71.2833  38.0
2       3    0   7.9250  26.0
3       1    0  53.1000  35.0
4       3    1   8.0500  35.0

In [99]:
from sklearn import tree

In [100]:
model = tree.DecisionTreeClassifier()

In [101]:
from sklearn.model_selection import train_test_split

In [106]:
X_train, X_test, y_train, y_test = train_test_split(df2,y,test_size=0.2)

In [107]:
model.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [108]:
model.predict([[3,1,7.2500,22.0]])

array([0], dtype=int64)

In [109]:
model.score(X_test,y_test)

0.7653631284916201

In [111]:
import pickle

In [112]:
with open('titanic_model','wb') as f:
    pickle.dump(model,f)